Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128MU506.h
extern volatile RPINR27BITS RPINR27bits __attribute__((__sfr__));

#define RPINR28 RPINR28
extern volatile unsigned int  RPINR28 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR28BITS {
  union {
    struct {
      unsigned U4RXR:7;
      unsigned :1;
      unsigned U4CTSR:7;
    };
    struct {
      unsigned U4RXR0:1;
      unsigned U4RXR1:1;
      unsigned U4RXR2:1;
      unsigned U4RXR3:1;
      unsigned U4RXR4:1;
      unsigned U4RXR5:1;
      unsigned U4RXR6:1;
      unsigned :1;
      unsigned U4CTSR0:1;
      unsigned U4CTSR1:1;
      unsigned U4CTSR2:1;
      unsigned U4CTSR3:1;
      unsigned U4CTSR4:1;
      unsigned U4CTSR5:1;
      unsigned U4CTSR6:1;
    };
  };
} RPINR28BITS;
extern volatile RPINR28BITS RPINR28bits __attribute__((__sfr__));

#define RPINR29 RPINR29
extern volatile unsigned int  RPINR29 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR29BITS {
  union {
    struct {
      unsigned SDI3R:7;
      unsigned :1;
      unsigned SCK3R:7;
    };
    struct {
      unsigned SDI3R0:1;
      unsigned SDI3R1:1;
      unsigned SDI3R2:1;
      unsigned SDI3R3:1;
      unsigned SDI3R4:1;
      unsigned SDI3R5:1;
      unsigned SDI3R6:1;
      unsigned :1;
      unsigned SCK3R0:1;
      unsigned SCK3R1:1;
      unsigned SCK3R2:1;
      unsigned SCK3R3:1;
      unsigned SCK3R4:1;
      unsigned SCK3R5:1;
      unsigned SCK3R6:1;
    };
  };
} RPINR29BITS;
extern volatile RPINR29BITS RPINR29bits __attribute__((__sfr__));

#define RPINR30 RPINR30
extern volatile unsigned int  RPINR30 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR30BITS {
  union {
    struct {
      unsigned SS3R:7;
    };
    struct {
      unsigned SS3R0:1;
      unsigned SS3R1:1;
      unsigned SS3R2:1;
      unsigned SS3R3:1;
      unsigned SS3R4:1;
      unsigned SS3R5:1;
      unsigned SS3R6:1;
    };
  };
} RPINR30BITS;
extern volatile RPINR30BITS RPINR30bits __attribute__((__sfr__));

#define RPINR37 RPINR37
extern volatile unsigned int  RPINR37 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR37BITS {
  union {
    struct {
      unsigned :8;
      unsigned SYNCI1R:7;
    };
    struct {
      unsigned :8;
      unsigned SYNCI1R0:1;
      unsigned SYNCI1R1:1;
      unsigned SYNCI1R2:1;
      unsigned SYNCI1R3:1;
      unsigned SYNCI1R4:1;
      unsigned SYNCI1R5:1;
      unsigned SYNCI1R6:1;
    };
  };
} RPINR37BITS;
extern volatile RPINR37BITS RPINR37bits __attribute__((__sfr__));

#define RPINR38 RPINR38
extern volatile unsigned int  RPINR38 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR38BITS {
  union {
    struct {
      unsigned SYNCI2R:7;
      unsigned :1;
      unsigned DTCMP1R:7;
    };
    struct {
      unsigned SYNCI2R0:1;
      unsigned SYNCI2R1:1;
      unsigned SYNCI2R2:1;
      unsigned SYNCI2R3:1;
      unsigned SYNCI2R4:1;
      unsigned SYNCI2R5:1;
      unsigned SYNCI2R6:1;
      unsigned :1;
      unsigned DTCMP1R0:1;
      unsigned DTCMP1R1:1;
      unsigned DTCMP1R2:1;
      unsigned DTCMP1R3:1;
      unsigned DTCMP1R4:1;
      unsigned DTCMP1R5:1;
      unsigned DTCMP1R6:1;
    };
  };
} RPINR38BITS;
extern volatile RPINR38BITS RPINR38bits __attribute__((__sfr__));

#define RPINR39 RPINR39
extern volatile unsigned int  RPINR39 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR39BITS {
  union {
    struct {
      unsigned DTCMP2R:7;
      unsigned :1;
      unsigned DTCMP3R:7;
    };
    struct {
      unsigned DTCMP2R0:1;
      unsigned DTCMP2R1:1;
      unsigned DTCMP2R2:1;
      unsigned DTCMP2R3:1;
      unsigned DTCMP2R4:1;
      unsigned DTCMP2R5:1;
      unsigned DTCMP2R6:1;
      unsigned :1;
      unsigned DTCMP3R0:1;
      unsigned DTCMP3R1:1;
      unsigned DTCMP3R2:1;
      unsigned DTCMP3R3:1;
      unsigned DTCMP3R4:1;
      unsigned DTCMP3R5:1;
      unsigned DTCMP3R6:1;
    };
  };
} RPINR39BITS;
extern volatile RPINR39BITS RPINR39bits __attribute__((__sfr__));

#define RPINR40 RPINR40
extern volatile unsigned int  RPINR40 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR40BITS {
  union {
    struct {
      unsigned DTCMP4R:7;
      unsigned :1;
      unsigned DTCMP5R:7;
    };
    struct {
      unsigned DTCMP4R0:1;
      unsigned DTCMP4R1:1;
      unsigned DTCMP4R2:1;
      unsigned DTCMP4R3:1;
      unsigned DTCMP4R4:1;
      unsigned DTCMP4R5:1;
      unsigned DTCMP4R6:1;
      unsigned :1;
      unsigned DTCMP5R0:1;
      unsigned DTCMP5R1:1;
      unsigned DTCMP5R2:1;
      unsigned DTCMP5R3:1;
      unsigned DTCMP5R4:1;
      unsigned DTCMP5R5:1;
      unsigned DTCMP5R6:1;
    };
  };
} RPINR40BITS;
extern volatile RPINR40BITS RPINR40bits __attribute__((__sfr__));

#define RPINR41 RPINR41
extern volatile unsigned int  RPINR41 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR41BITS {
  union {
    struct {
      unsigned DTCMP6R:7;
    };
    struct {
      unsigned DTCMP6R0:1;
      unsigned DTCMP6R1:1;
      unsigned DTCMP6R2:1;
      unsigned DTCMP6R3:1;
      unsigned DTCMP6R4:1;
      unsigned DTCMP6R5:1;
      unsigned DTCMP6R6:1;
    };
  };
} RPINR41BITS;
extern volatile RPINR41BITS RPINR41bits __attribute__((__sfr__));

#define DFCON DFCON
extern volatile unsigned int  DFCON __attribute__((__sfr__));
__extension__ typedef struct tagDFCONBITS {
  union {
    struct {
      unsigned DFCMD:2;
      unsigned :1;
      unsigned DFIPE:1;
      unsigned DFERR:2;
      unsigned DFWREN:1;
      unsigned DFST:1;
      unsigned :5;
      unsigned DFIDL:1;
      unsigned DFRDY:1;
      unsigned DFEN:1;
    };
    struct {
      unsigned DFCMD0:1;
      unsigned DFCMD1:1;
      unsigned :2;
      unsigned DFERR0:1;
      unsigned DFERR1:1;
    };
  };
} DFCONBITS;
extern volatile DFCONBITS DFCONbits __attribute__((__sfr__));

#define DFKEY DFKEY
extern volatile unsigned int  DFKEY __attribute__((__sfr__));
#define DFADDR DFADDR
extern volatile unsigned int  DFADDR __attribute__((__sfr__));
typedef struct tagDFADDRBITS {
  unsigned DFADDR:9;
} DFADDRBITS;
