Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128MU506.h
#define _IPC16_U2EIP0_POSITION                   0x00000008
#define _IPC16_U2EIP0_MASK                       0x00000100
#define _IPC16_U2EIP0_LENGTH                     0x00000001

#define _IPC16_U2EIP1_POSITION                   0x00000009
#define _IPC16_U2EIP1_MASK                       0x00000200
#define _IPC16_U2EIP1_LENGTH                     0x00000001

#define _IPC16_U2EIP2_POSITION                   0x0000000A
#define _IPC16_U2EIP2_MASK                       0x00000400
#define _IPC16_U2EIP2_LENGTH                     0x00000001

#define _IPC16_CRCIP0_POSITION                   0x0000000C
#define _IPC16_CRCIP0_MASK                       0x00001000
#define _IPC16_CRCIP0_LENGTH                     0x00000001

#define _IPC16_CRCIP1_POSITION                   0x0000000D
#define _IPC16_CRCIP1_MASK                       0x00002000
#define _IPC16_CRCIP1_LENGTH                     0x00000001

#define _IPC16_CRCIP2_POSITION                   0x0000000E
#define _IPC16_CRCIP2_MASK                       0x00004000
#define _IPC16_CRCIP2_LENGTH                     0x00000001

#define _IPC17_C1TXIP_POSITION                   0x00000008
#define _IPC17_C1TXIP_MASK                       0x00000700
#define _IPC17_C1TXIP_LENGTH                     0x00000003

#define _IPC17_C1TXIP0_POSITION                  0x00000008
#define _IPC17_C1TXIP0_MASK                      0x00000100
#define _IPC17_C1TXIP0_LENGTH                    0x00000001

#define _IPC17_C1TXIP1_POSITION                  0x00000009
#define _IPC17_C1TXIP1_MASK                      0x00000200
#define _IPC17_C1TXIP1_LENGTH                    0x00000001

#define _IPC17_C1TXIP2_POSITION                  0x0000000A
#define _IPC17_C1TXIP2_MASK                      0x00000400
#define _IPC17_C1TXIP2_LENGTH                    0x00000001

#define _IPC19_CTMUIP_POSITION                   0x00000004
#define _IPC19_CTMUIP_MASK                       0x00000070
#define _IPC19_CTMUIP_LENGTH                     0x00000003

#define _IPC19_CTMUIP0_POSITION                  0x00000004
#define _IPC19_CTMUIP0_MASK                      0x00000010
#define _IPC19_CTMUIP0_LENGTH                    0x00000001

#define _IPC19_CTMUIP1_POSITION                  0x00000005
#define _IPC19_CTMUIP1_MASK                      0x00000020
#define _IPC19_CTMUIP1_LENGTH                    0x00000001

#define _IPC19_CTMUIP2_POSITION                  0x00000006
#define _IPC19_CTMUIP2_MASK                      0x00000040
#define _IPC19_CTMUIP2_LENGTH                    0x00000001

#define _IPC20_U3EIP_POSITION                    0x00000004
#define _IPC20_U3EIP_MASK                        0x00000070
#define _IPC20_U3EIP_LENGTH                      0x00000003

#define _IPC20_U3RXIP_POSITION                   0x00000008
#define _IPC20_U3RXIP_MASK                       0x00000700
#define _IPC20_U3RXIP_LENGTH                     0x00000003

#define _IPC20_U3TXIP_POSITION                   0x0000000C
#define _IPC20_U3TXIP_MASK                       0x00007000
#define _IPC20_U3TXIP_LENGTH                     0x00000003

#define _IPC20_U3EIP0_POSITION                   0x00000004
#define _IPC20_U3EIP0_MASK                       0x00000010
#define _IPC20_U3EIP0_LENGTH                     0x00000001

#define _IPC20_U3EIP1_POSITION                   0x00000005
#define _IPC20_U3EIP1_MASK                       0x00000020
#define _IPC20_U3EIP1_LENGTH                     0x00000001

#define _IPC20_U3EIP2_POSITION                   0x00000006
#define _IPC20_U3EIP2_MASK                       0x00000040
#define _IPC20_U3EIP2_LENGTH                     0x00000001

#define _IPC20_U3RXIP0_POSITION                  0x00000008
#define _IPC20_U3RXIP0_MASK                      0x00000100
#define _IPC20_U3RXIP0_LENGTH                    0x00000001

#define _IPC20_U3RXIP1_POSITION                  0x00000009
#define _IPC20_U3RXIP1_MASK                      0x00000200
#define _IPC20_U3RXIP1_LENGTH                    0x00000001

#define _IPC20_U3RXIP2_POSITION                  0x0000000A
#define _IPC20_U3RXIP2_MASK                      0x00000400
#define _IPC20_U3RXIP2_LENGTH                    0x00000001

#define _IPC20_U3TXIP0_POSITION                  0x0000000C
#define _IPC20_U3TXIP0_MASK                      0x00001000
#define _IPC20_U3TXIP0_LENGTH                    0x00000001

#define _IPC20_U3TXIP1_POSITION                  0x0000000D
#define _IPC20_U3TXIP1_MASK                      0x00002000
#define _IPC20_U3TXIP1_LENGTH                    0x00000001

#define _IPC20_U3TXIP2_POSITION                  0x0000000E
#define _IPC20_U3TXIP2_MASK                      0x00004000
#define _IPC20_U3TXIP2_LENGTH                    0x00000001

#define _IPC21_USB1IP_POSITION                   0x00000008
#define _IPC21_USB1IP_MASK                       0x00000700
#define _IPC21_USB1IP_LENGTH                     0x00000003

#define _IPC21_U4EIP_POSITION                    0x0000000C
#define _IPC21_U4EIP_MASK                        0x00007000
#define _IPC21_U4EIP_LENGTH                      0x00000003

#define _IPC21_USB1IP0_POSITION                  0x00000008
#define _IPC21_USB1IP0_MASK                      0x00000100
#define _IPC21_USB1IP0_LENGTH                    0x00000001

#define _IPC21_USB1IP1_POSITION                  0x00000009
#define _IPC21_USB1IP1_MASK                      0x00000200
#define _IPC21_USB1IP1_LENGTH                    0x00000001

#define _IPC21_USB1IP2_POSITION                  0x0000000A
#define _IPC21_USB1IP2_MASK                      0x00000400
#define _IPC21_USB1IP2_LENGTH                    0x00000001

#define _IPC21_U4EIP0_POSITION                   0x0000000C
#define _IPC21_U4EIP0_MASK                       0x00001000
#define _IPC21_U4EIP0_LENGTH                     0x00000001

#define _IPC21_U4EIP1_POSITION                   0x0000000D
#define _IPC21_U4EIP1_MASK                       0x00002000
#define _IPC21_U4EIP1_LENGTH                     0x00000001

#define _IPC21_U4EIP2_POSITION                   0x0000000E
#define _IPC21_U4EIP2_MASK                       0x00004000
#define _IPC21_U4EIP2_LENGTH                     0x00000001

#define _IPC22_U4RXIP_POSITION                   0x00000000
#define _IPC22_U4RXIP_MASK                       0x00000007
#define _IPC22_U4RXIP_LENGTH                     0x00000003

#define _IPC22_U4TXIP_POSITION                   0x00000004
#define _IPC22_U4TXIP_MASK                       0x00000070
#define _IPC22_U4TXIP_LENGTH                     0x00000003

